#### Terraform Format and Style 🖌 `success`
#### Terraform Initialization ⚙️ `success`
#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.discord_simde.discord_text_channel.games has changed
  ~ resource "discord_text_channel" "games" {
        id                       = "781925726840553514"
        name                     = "clashofcode-and-cie"
      ~ position                 = 5 -> 7
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.notifications has changed
  ~ resource "discord_text_channel" "notifications" {
        id                       = "778636669737369651"
        name                     = "github-notifications"
      ~ position                 = 4 -> 6
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.questions-techniques has changed
  ~ resource "discord_text_channel" "questions-techniques" {
        id                       = "816982748500983829"
        name                     = "questions-techniques"
      ~ position                 = 2 -> 4
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.spam has changed
  ~ resource "discord_text_channel" "spam" {
        id                       = "816982749675913226"
        name                     = "spam"
      ~ position                 = 3 -> 5
        # (5 unchanged attributes hidden)
    }

  # module.github.github_team_repository.application_utcbde_utc_mobile has changed
  ~ resource "github_team_repository" "application_utcbde_utc_mobile" {
      ~ etag       = "W/\"2fc1dbda899c311c906817158996c01896dd8ae8fec517e15fb538c3738be624\"" -> "W/\"ccb34618495caf324692160dcd84fb6d98c51fe7fc6bbb63923c7e514c7fffbc\""
        id         = "3158184:utc-mobile"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.covoitutc_covoitutc has changed
  ~ resource "github_team_repository" "covoitutc_covoitutc" {
      ~ etag       = "W/\"1c75a58d3eb2dbb53ba0e176ba8cb33dbe88d68b0232bf94b448bf0165e23a6a\"" -> "W/\"d34b672fa05c972c3739a0820289b5aef74aec770127e9407be04c9fb461dbe7\""
        id         = "3158193:covoitutc"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.payutc_payutc_mobile has changed
  ~ resource "github_team_repository" "payutc_payutc_mobile" {
      ~ etag       = "W/\"09c603afb397b085817039e73b829e1975582e24b28c1fce070e6789bc7ceeff\"" -> "W/\"42b3258e2c62e985be348cc094810d9c4a8e8809f315b564f04588d8c125f4fa\""
        id         = "3158200:payutc-mobile"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.portail_portail has changed
  ~ resource "github_team_repository" "portail_portail" {
      ~ etag       = "W/\"7f2e3594d7c2e607e59764aa93a88a803064c31eb6cc692f10aa4c15708fce13\"" -> "W/\"5554b5872edeb7abc4a6538ef9fe7bb6f44b2b71eecd880af78f5df607fc6ffb\""
        id         = "3158212:portail"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.portail_utc_mobile has changed
  ~ resource "github_team_repository" "portail_utc_mobile" {
      ~ etag       = "W/\"2fc1dbda899c311c906817158996c01896dd8ae8fec517e15fb538c3738be624\"" -> "W/\"ccb34618495caf324692160dcd84fb6d98c51fe7fc6bbb63923c7e514c7fffbc\""
        id         = "3158212:utc-mobile"
        # (3 unchanged attributes hidden)
    }

  # module.github.github_team_repository.simde_terraform has changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"b589219a8faf66f7b1e1007aaa28a4210ac683e2a5b054cc51755c247740528a\"" -> "W/\"df11af4d4517ca99dd410a3e4e7458e3e74942fd2c5cdab2a1b45f44b332c3f4\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }

  # module.discord_simde.module.general.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "759903967211028490"
        name                     = "général"
      ~ position                 = 0 -> 3
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-admin.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "759903971316858891"
        name                     = "private-admin"
      ~ position                 = 0 -> 22
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-bde.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "811739466981048336"
        name                     = "private-bde"
      ~ position                 = 0 -> 19
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-comet.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "895025367050518539"
        name                     = "private-comet"
      ~ position                 = 0 -> 10
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-emploidut.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "814062716833890344"
        name                     = "private-emploidut"
      ~ position                 = 0 -> 20
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-gesasso.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "892367301653958656"
        name                     = "private-gesasso"
      ~ position                 = 0 -> 18
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integ.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "802911396328767559"
        name                     = "private-integ"
      ~ position                 = 0 -> 13
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integfev.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "897464434405027921"
        name                     = "private-integfev"
      ~ position                 = 0 -> 21
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-jeffrey.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "782684809008775169"
        name                     = "private-jeffrey"
      ~ position                 = 0 -> 14
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-payutc.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "776093859746676736"
        name                     = "private-payutc"
      ~ position                 = 0 -> 11
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-sparkle.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "938907322577731614"
        name                     = "private-sparkle"
      ~ position                 = 0 -> 16
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-treso.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "777569555114885140"
        name                     = "private-flairsou"
      ~ position                 = 0 -> 9
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-woolly.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "783640460572885022"
        name                     = "private-woolly"
      ~ position                 = 0 -> 15
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.public-entraide.discord_text_channel.text has changed
  ~ resource "discord_text_channel" "text" {
        id                       = "909792616424558602"
        name                     = "public-entraide"
      ~ position                 = 0 -> 8
        # (5 unchanged attributes hidden)
    }

  # module.github.module.marie_davenne.github_membership.membership has changed
  ~ resource "github_membership" "membership" {
      ~ etag     = "W/\"1ddcd19d228954e6376076315f8312a05f626746601d5e8b038a46ad4c23a626\"" -> "W/\"12f07ab3c82d4bd396805b9b7cdd1237986a5950bdf15c321fe69c3ecdba9306\""
        id       = "SiMDE-Projects:maradav08"
        # (2 unchanged attributes hidden)
    }

  # module.github.module.marie_davenne.github_team_membership.membership["flairsou"] has changed
  ~ resource "github_team_membership" "membership" {
      ~ etag     = "W/\"65cc415a7fb7914313800ac0354a2fb170a1d57c5ca5c1d45c54ba4b1ed2b720\"" -> "W/\"ef832914a814be0c8da190fc3f4cee65e5d43c0086aa102277de8e1a62ea97ab\""
        id       = "4276153:maradav08"
        # (3 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_text_channel.games will be updated in-place
  ~ resource "discord_text_channel" "games" {
        id                       = "781925726840553514"
        name                     = "clashofcode-and-cie"
      ~ position                 = 7 -> 5
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.notifications will be updated in-place
  ~ resource "discord_text_channel" "notifications" {
        id                       = "778636669737369651"
        name                     = "github-notifications"
      ~ position                 = 6 -> 4
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.questions-techniques will be updated in-place
  ~ resource "discord_text_channel" "questions-techniques" {
        id                       = "816982748500983829"
        name                     = "questions-techniques"
      ~ position                 = 4 -> 2
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_text_channel.spam will be updated in-place
  ~ resource "discord_text_channel" "spam" {
        id                       = "816982749675913226"
        name                     = "spam"
      ~ position                 = 5 -> 3
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.general.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "759903967211028490"
        name                     = "général"
      ~ position                 = 3 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-admin.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "759903971316858891"
        name                     = "private-admin"
      ~ position                 = 22 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-bde.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "811739466981048336"
        name                     = "private-bde"
      ~ position                 = 19 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-comet.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "895025367050518539"
        name                     = "private-comet"
      ~ position                 = 10 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-emploidut.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "814062716833890344"
        name                     = "private-emploidut"
      ~ position                 = 20 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-gesasso.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "892367301653958656"
        name                     = "private-gesasso"
      ~ position                 = 18 -> 0
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integ.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "802911396328767559"
        name                     = "private-integ"
      ~ position                 = 13 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integfev.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "897464434405027921"
        name                     = "private-integfev"
      ~ position                 = 21 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-jeffrey.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "782684809008775169"
        name                     = "private-jeffrey"
      ~ position                 = 14 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-payutc.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "776093859746676736"
        name                     = "private-payutc"
      ~ position                 = 11 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-sparkle.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "938907322577731614"
        name                     = "private-sparkle"
      ~ position                 = 16 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-treso.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "777569555114885140"
        name                     = "private-flairsou"
      ~ position                 = 9 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-woolly.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "783640460572885022"
        name                     = "private-woolly"
      ~ position                 = 15 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.module.public-entraide.discord_text_channel.text will be updated in-place
  ~ resource "discord_text_channel" "text" {
        id                       = "909792616424558602"
        name                     = "public-entraide"
      ~ position                 = 8 -> 0
        # (5 unchanged attributes hidden)
    }

  # module.github.module.repositories.github_issue_label.gesasso_bug will be created
  + resource "github_issue_label" "gesasso_bug" {
      + color      = "d73a4a"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "bug"
      + repository = "gesasso_mkultra"
      + url        = (known after apply)
    }

  # module.github.module.repositories.github_issue_label.gesasso_documentation will be created
  + resource "github_issue_label" "gesasso_documentation" {
      + color      = "0075ca"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "documentation"
      + repository = "gesasso_mkultra"
      + url        = (known after apply)
    }

  # module.github.module.repositories.github_issue_label.gesasso_idea will be created
  + resource "github_issue_label" "gesasso_idea" {
      + color      = "182F08"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "idea"
      + repository = "gesasso_mkultra"
      + url        = (known after apply)
    }

  # module.github.module.repositories.github_issue_label.gesasso_task will be created
  + resource "github_issue_label" "gesasso_task" {
      + color      = "B89826"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "task"
      + repository = "gesasso_mkultra"
      + url        = (known after apply)
    }

  # module.github.module.repositories.github_issue_label.gesasso_wontfix will be created
  + resource "github_issue_label" "gesasso_wontfix" {
      + color      = "ffffff"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "wontfix"
      + repository = "gesasso_mkultra"
      + url        = (known after apply)
    }

  # module.github.module.repositories.github_project_column.gesasso_project_approved will be created
  + resource "github_project_column" "gesasso_project_approved" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "APPROVED"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.gesasso_project_codeReview will be created
  + resource "github_project_column" "gesasso_project_codeReview" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "CODE REVIEW"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.gesasso_project_doing will be created
  + resource "github_project_column" "gesasso_project_doing" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "DOING"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.gesasso_project_done will be created
  + resource "github_project_column" "gesasso_project_done" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "DONE"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.gesasso_project_todo will be created
  + resource "github_project_column" "gesasso_project_todo" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "TODO"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_project_column.gesasso_project_wontdo will be created
  + resource "github_project_column" "gesasso_project_wontdo" {
      + column_id  = (known after apply)
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "WON'T DO"
      + project_id = (known after apply)
    }

  # module.github.module.repositories.github_repository_project.gesasso_project will be created
  + resource "github_repository_project" "gesasso_project" {
      + body       = "Gesasso project management"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "Gesasso project"
      + repository = "gesasso_mkultra"
      + url        = (known after apply)
    }

Plan: 12 to add, 18 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*